week_6/01.Monday/my_app/app/controllers/static_controller.rb

  def index
    @random_number = rand(10000)
    @user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def index_post
    puts "Hello from the server "
    user = User.new
    user.first_name = params["first_name"]
    user.last_name = params["last_name"]
    user.save
---
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Faten"], ["last_name", "Issa"], ["created_at", "2021-02-08 14:55:58.947323"], ["updated_at", "2021-02-08 14:55:58.947323"]]