week_6/01.Monday/the_gossip_project/app/controllers/index_controller.rb

  def new
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"