week_6/01.Monday/the_gossip_project/app/controllers/show_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show_gossip
    @gossip = Gossip.find(params[:id])